* Harrington 2015 27km-12B
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | harrington_2015_27km-12B
Descriptive Name                      | 27km-12B
Area                                  | 
Data reference                        | T. Meierbachtol email
Data DOI                              | 
Science reference                     | Harrington, Joel A., Humphrey, Neil F., Harper, Joel T.: Temperature distribution and thermal anomalies along a flowline of the Greenland ice sheet , Annals of Glaciology 56(70), 98–104, 2015 
Science DOI                           | 10.3189/2015AoG70A946
Date                                  | 2012
Longitude [°E]                        | -49.71778333
Latitude [°N]                         | 67.2037
Location source                       | T. Meierbachtol email
Depth of top measurement [m]          | 18.0
Depth of bottom measurement [m]       | 690.0
Ice thickness [m]                     | 688
Coverage [% of thickness]             | 98
Ice thickness source                  | T. Meierbachtol email
Measured from: Top, Bottom, Relative  | T
General_Note                          | See data in M1-10 folder
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | Harrington 2015 name: S4-B
#+end_example

** Temperature

** Thickness

** Location

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|     d |      t |
|  17.5 | -5.655 |
|  37.5 | -4.875 |
|  57.5 |  -4.68 |
|  77.5 | -4.485 |
|  97.5 |  -4.81 |
| 117.5 | -4.875 |
| 137.5 | -5.135 |
| 157.5 | -5.265 |
| 177.5 |  -5.59 |
| 197.5 |  -5.33 |
| 217.5 | -5.655 |
| 237.5 | -5.785 |
| 257.5 | -5.655 |
| 277.5 | -5.525 |
| 297.5 |  -5.59 |
| 317.5 |  -5.46 |
| 337.5 |   -5.2 |
| 357.5 | -5.005 |
| 377.5 | -4.745 |
| 397.5 | -4.485 |
| 407.5 | -4.355 |
| 427.5 |  -4.03 |
| 447.5 | -3.445 |
| 467.5 |  -2.99 |
| 487.5 | -2.665 |
| 507.5 |  -1.95 |
| 527.5 | -1.495 |
| 547.5 |  -1.17 |
| 567.5 |  -0.91 |
| 587.5 | -0.455 |
| 607.5 |  -0.52 |
| 627.5 |  -0.39 |
| 647.5 |  -0.52 |
| 667.5 | -0.585 |
| 687.5 | -0.455 |

